# NumberOfRows Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTable..::..NumberOfRows Property
FamilySizeTable Class See Also
---
Number of rows in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfRows { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfRows As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfRows {
	int get ();
}
```

# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace